tests3/api_test_results/60周五5/5/_172151/stress_course_list_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 124.71.46.184 (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        124.71.46.184
Server Port:            5000

Document Path:          /course/
Document Length:        5481 bytes

Concurrency Level:      25
Time taken for tests:   4.293 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      567100 bytes
HTML transferred:       548100 bytes
Requests per second:    23.30 [#/sec] (mean)
Time per request:       1073.181 [ms] (mean)
Time per request:       42.927 [ms] (mean, across all concurrent requests)
Transfer rate:          129.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       30   42 100.4     32    1036
Processing:    51  913 520.5    765    1773
Waiting:       41  615 492.6    482    1770
Total:         84  955 527.3    797    1805

Percentage of the requests served within a certain time (ms)
  50%    797
  66%    800
  75%   1799
  80%   1800
  90%   1803
  95%   1804
  98%   1805
  99%   1805
 100%   1805 (longest request)